
// @skip-check module-structure-method-in-regions
Процедура ПриНачалеРаботыСистемы()

	КлиентскоеПриложение.УстановитьКраткийЗаголовок("Вихарев Алексей");


Серверный.НаСервере();
//	ПредупредитьОРабочемДне();

КонецПроцедуры

////@skip-check module-structure-method-in-regions
//Процедура ПредупредитьОРабочемДне()
//
//	//@skip-check use-non-recommended-method
//	Перем ЧтоХочетПользователь;
//	Если ДеньНедели(ТекущаяДата()) < 6 Тогда
//		ПоказатьОповещениеПользователя("Сегодня рабочий день!");
//	КонецЕсли;
//
//	ДниНедели = Новый Массив;
//	ДниНедели.Добавить("Понедельник");
//	ДниНедели.Добавить("Вторник");
//	ДниНедели.Добавить("Среда");
//	ДниНедели.Добавить("Четверг");
//	ДниНедели.Добавить("Пятница");
//	ДниНедели.Добавить("Суббота");
//	ДниНедели.Добавить("Воскресенье");
//	ДниНедели.Удалить(ДеньНедели(ТекущаяДата()) - 1);
//	ДниНедели.Добавить();
//
//	МестоРаботы = Новый Структура;
//	МестоРаботы.Вставить("Должность", "Ведущий специалист");
//	МестоРаботы.Вставить("НачалоРаботы", Дата(2018, 9, 1));
//	МестоРаботы.Вставить("Оклад", 40000);
//
////	 Обращение к элементам структуры.
//	ДолжностьСотрудника = МестоРаботы.Должность;
//	ОкладСотрудника = МестоРаботы.Оклад;
//	НачалоРаботыСотрудника = местоРаботы.НачалоРаботы;
//	
//	ЧегоХочетПользователь = "Оклад";
//	ВернутьПользователю = МестоРаботы[ЧегоХочетПользователь];
//		
//
////	МестоРаботы = Новый Структура("Должность, НачалоРаботы", "Ведущий специалист", Дата(2018, 9, 1));
////	
////	// Здесь вы хотите использовать оклад.
////
////	ОкладСотрудника = Неопределено;
////	Если НЕ МестоРаботы.Свойство("Оклад", ОкладСотрудника) Тогда
////		ПоказатьПредупреждение( , "Оклад сотрудника отсутствует.");
////		Возврат;
////	КонецЕсли;
////
////	ОкладСотрудника = МестоРаботы.Оклад;
//КонецПроцедуры